 const Discord = require('discord-selfbot-v13');
 const client = new Discord.Client();
  const token = process.env.token;

   const targetUsers = ['1152586197382746176', '1030633335623536640', '973998317191172158','1156284041226625097','1160078311150592050','1104139301597499484','1158944434772254861','1132345850736156805','1140634112181424188','884533062212407347','1156284041226625097','1151220163572682902','1127226565080649838']; // قائمة معرفات المستخدمين المستهدفين
    const targetChannels = ['1136299729119084564']; // قائمة معرفات القنوات المستهدفة
     const delayBetweenReplies = 6000; // زمن الانتظار بين كل رسالة (بالميلي ثانية)

      const randomReplies = [
           'امك تناكت من كل بقاع الارض', 
             'كسمج صار اسود من كثر النيك', 
               'اركب امك العير' ,
                 ' يابن المنكوحة المفتوحة ياللي جيت انيكها لقيتها ملوحة', 
                   'يابن كوم زنا الزواني ياللي امك مني بتعاني  ', 
                     'هسحب سحبة وانيك امك القحبة هسحب', 
                       'هسحب سحبتين وانيك امك مرتين', 
                         'هسحب تلت سحبات وانيك امك يوم التلات', 
                           'نكت امك من خرمها الواسع', 
                             'يابن الهايجة اللايجة اللي بتتناك من الخلايجة',   'كسختمك' , 
                               'فشخ امك',
                                 'انتهاك عرض امك',
                                   'نيك كسمك',
                                     'فتح امك بمطوة',
                                       'هدم امك بمطرقة',
                                         'تقطيع جسم امك بالسكينة',
                                           'اختراق مهبل امك بحديدة',
                                             'يبن المره المتناكه',
                                               'ابعبص امك يبن الوسخه',
                                                 'اخزوق كسمك',
                                                   'حرق امك بالبنزين',
                                                     'ثقب كسمك بمسمار',
                                                       'نيكمك',
                                                         'نيكختك',
                                                           'نيكعرضك',
                                                             'نيكشرفك',
                                                               'نيك ميتين اختك',
                                                                 'اغتصاب امك',
                                                                   'اغتيال امك بقناص',
                                                                     'مضاجعه جثه امك',
                                                                       'تدمير كسمك',
                                                                         'تطهير كسمك من النجاسه',
                                                                           'اقتلاع مصارين امك',
                                                                             'شطر مهبل والدتك',
                                                                               'تحريف كسمك بزبي',
                                                                                 'خرق كسمك بقضيب عنيف',
                                                                                   'القذف بكسمك',  'وضع القضيب بفم امك',
                                                                                     'كسختك يجنن',
                                                                                       'كسمك يغريني',
                                                                                         'كسخالتك زاكي',
                                                                                           'جاري نيك امك',
                                                                                             'ممارسه السكس مع عائلتك',
                                                                                               'ممارسه الجنس مع امك',
                                                                                                 'صفع طيز امك',
                                                                                                   'تحمير طيز امك',
                                                                                                     'اغتصاب مؤخره امك الناعمه',
                                                                                                       'مص ثدي والدتك',
                                                                                                         'القذف بديود امك',
                                                                                                           'وضع القضيب بطيز امك',
                                                                                                             'القذف بطيز امك',
                                                                                                               'قلي كسمك بالزيت',
                                                                                                                 'كسمك واسع ووردي',
                                                                                                                   'كسمك فاتن',
                                                                                                                     'طيز امك رائعه',
                                                                                                                       'مهبل اختك جميل',
                                                                                                                         'تقطيع أحشاء امك واكلها',
                                                                                                                           'قطع أعضاء امك بخنجر',
                                                                                                                             'وضع خنجر بمؤخرة امك',
                                                                                                                               'وضع عير بفم امك',
                                                                                                                                 'اغتصاب شرف اهلك',
                                                                                                                                   'مضاجعه عرضك',
                                                                                                                                     'نيك كسمين امك',
                                                                                                                                       'نيك كسختمك',
                                                                                                                                         'نيك اختك',
                                                                                                                                           'نيك كسم امك',
                                                                                                                                             'زبي ينتصب بكسمك',
                                                                                                                                               'ضبط زبي بكسمك',
                                                                                                                                                 'ادخال قضيبي بكسمك',
                                                                                                                                                   'دخول قضيبي لكسمك',
                                                                                                                                                     'محنه امك',
                                                                                                                                                       'موت امك ع زبي',
                                                                                                                                                         'انتهاك كسمك بقضيب شرير',
                                                                                                                                                           'تفجير كسمك بالاربجي','انيكمك بقاع البير', 
                                                                                                                                                             'انيكمك و اصير امير',
                                                                                                                                                               'انيك امك بقاع البير', 
                                                                                                                                                                 'كسختك اليوم يتناك', 
                                                                                                                                                                   'اشق كس عرضك', 
                                                                                                                                                                     'يا ولد الزانية ', 
                                                                                                                                                                       'كسمك تناك بك مكان', 
                                                                                                                                                                         'كسمك طلع باللاعلام', 
                                                                                                                                                                           'يا ولد القحاب', 
                                                                                                                                                                             'اشل كسمك بزبي الجبار', 
                                                                                                                                                                               'يا فاجر يا متناك', 
                                                                                                                                                                                 'انكح اصلك', 
                                                                                                                                                                                   'اشيل مليون زب و ادخلهم بكسمك', 
                                                                                                                                                                                     'كسمك ثقب اسود', 
                                                                                                                                                                                       'كسمك يبتلع اي زب', 
                                                                                                                                                                                         'زبي الكبير بكسمك با ولد الديوث', 
                                                                                                                                                                                           'اشق رحم امك', 
                                                                                                                                                                                             'امارس نيك امك', 
                                                                                                                                                                                               'يلعن كسمك', 
                                                                                                                                                                                                 'يا ولد المنكوحة', 
                                                                                                                                                                                                   'اسحب سحبة و انيك امك القحبة', 
                                                                                                                                                                                                     'انيك كسمك بكل دار', 
                                                                                                                                                                                                       'يا جرار كسمك يبيله عير فرار', 
                                                                                                                                                                                                         'شلع كسمك', 
                                                                                                                                                                                                           'قلع كسختك', 
                                                                                                                                                                                                             'ادحش بكسمك العتاد', 
                                                                                                                                                                                                               'انيج اصلك يا ولد الممحونة', 
                                                                                                                                                                                                                 'امج على عيري مجنونة', 
                                                                                                                                                                                                                   'افتح كسمك',   'امج على عيري مجنونة', 
                                                                                                                                                                                                                     'افتح كسمك', 
                                                                                                                                                                                                                       'افتح كسختك', 
                                                                                                                                                                                                                         'افتح كسستك', 
                                                                                                                                                                                                                           'با ولد المناكيح', 
                                                                                                                                                                                                                             'كسمك تناك و صارت تصيح', 
                                                                                                                                                                                                                               'كسمك مليان جراثيم', 
                                                                                                                                                                                                                                 'كسمك مليان عيورة', 
                                                                                                                                                                                                                                   'يا ولد الامورة', 
                                                                                                                                                                                                                                     'تم نيك امك بكل حنونة', 
                                                                                                                                                                                                                                       'انيك امك بتونس', 
                                                                                                                                                                                                                                         'يا ولد المومس', 
                                                                                                                                                                                                                                           'عير بكس عرصك', 
                                                                                                                                                                                                                                             'انيك امك بوسط الدار', 
                                                                                                                                                                                                                                               'امك على زبي تنلف و تندار', 
                                                                                                                                                                                                                                                 'و انيك امك بعير نار', 
                                                                                                                                                                                                                                                   'و ادحش بطيزمك العتاد', 
                                                                                                                                                                                                                                                     'امك تناكت من كل بقاع الارض', 
                                                                                                                                                                                                                                                       'كسمج صار اسود من كثر النيك', 
                                                                                                                                                                                                                                                         'اركب امك العير' ,
                                                                                                                                                                                                                                                           ' يابن المنكوحة المفتوحة ياللي جيت انيكها لقيتها ملوحة'
                                                                                                                                                                                                                                                           ];
                                                                                                                                                                                                                                                            
                                                                                                                                                                                                                                                             client.on('ready', () => {
                                                                                                                                                                                                                                                              console.log(`Logged in as ${client.user.tag}`);
                                                                                                                                                                                                                                                               });

                                                                                                                                                                                                                                                                client.on('messageCreate', async (message) => {
                                                                                                                                                                                                                                                                   const isTargetUser = targetUsers.includes(message.author.id);
                                                                                                                                                                                                                                                                     const isTargetChannel = targetChannels.includes(message.channel.id);
                                                                                                                                                                                                                                                                      
                                                                                                                                                                                                                                                                        if (isTargetUser && isTargetChannel) {
                                                                                                                                                                                                                                                                            const randomReply = randomReplies[Math.floor(Math.random() * randomReplies.length)];

                                                                                                                                                                                                                                                                                 try {
                                                                                                                                                                                                                                                                                      // يظهر بأنه يكتب
                                                                                                                                                                                                                                                                                             message.channel.sendTyping();

                                                                                                                                                                                                                                                                                                    // زمن الانتظار قبل الرد
                                                                                                                                                                                                                                                                                                           await new Promise(resolve => setTimeout(resolve, delayBetweenReplies));

                                                                                                                                                                                                                                                                                                                 // يرد على الرسالة
                                                                                                                                                                                                                                                                                                                        const replyMessage = await message.reply(randomReply);
                                                                                                                                                                                                                                                                                                                               console.log(`Replied to message: ${replyMessage.content}`);
                                                                                                                                                                                                                                                                                                                                   } catch (error) {
                                                                                                                                                                                                                                                                                                                                         console.error(`Error replying to message: ${error}`);
                                                                                                                                                                                                                                                                                                                                              }
                                                                                                                                                                                                                                                                                                                                                 }
                                                                                                                                                                                                                                                                                                                                                  });
                                                                                                                                                                                                                                                                                                                                                   
                                                                                                                                                                                                                                                                                                                                                    const express = require("express");
                                                                                                                                                                                                                                                                                                                                                     const app = express();

                                                                                                                                                                                                                                                                                                                                                      app.listen(() => console.log("I'm Ready To nik ksm iblis..! 24H"));
                                                                                                                                                                                                                                                                                                                                                       app.get('/', (req, res) => {
                                                                                                                                                                                                                                                                                                                                                         res.send(`
                                                                                                                                                                                                                                                                                                                                                            <body>
                                                                                                                                                                                                                                                                                                                                                               <center><h1>كسمك ابليس عظم</h1></center
                                                                                                                                                                                                                                                                                                                                                                  </body>`);
                                                                                                                                                                                                                                                                                                                                                                  });
                                                                                                                                                                                                                                                                                                                                                                  client.login(process.env.token)

                                                                                                                                                                                                                                                                                                                                                                  